# 主页主要文本

TitleLabel = "办公自动化工厂V0.1"

AppInfoComment = ("办公自动化工厂是一款使用 Python 编写的自动化办公应用程序。"
                  "此工具旨在帮助企业或个人用户高效地解决一些办公常见的需求场景,例如:数据校验,文件转换等。"
                  "该程序集成了多种有趣又实用的应用，能够适应多种场景下的办公需求。")

# AppInfoComment = ("Excel 数据校验 Master 是一款使用 Python 编写的数据校验工具，主要利用 pandas 库进行数据处理和分析。"
#                   "此工具旨在帮助企业或个人用户高效地检查 Excel 文件中的数据一致性、准确性和完整性。"
#                   "该程序集成了多种数据校验规则，能够适应多种场景下的数据验证需求。")

funcMarkDown = """## Excel数据校验大师
####
### 1. 非空校验
- 确保指定列中的每个单元格都不为空 - 适用于任何需要强制输入的字段，例如姓名、地址等。
### 2. 身份证校验

- 验证指定列中的身份证号码是否符合中国居民身份证号码的标准格式- 适用于需要验证个人身份信息的场景，如注册、开户等。

### 3. 手机号校验

- 验证指定列中的手机号码是否符合标准格式 - 适用于需要验证联系信息的场景，如客户资料录入、营销活动等。

### 4. 枚举值校验

- 验证指定列中的值是否属于预设的枚举集合 - 适用于需要限定输入范围的字段，例如性别（男、女）、婚姻状态（已婚、未婚）等。

### 5. 数值校验

- 验证指定列中的数值是否在指定的范围内 - 适用于需要限制数值范围的字段，例如年龄、金额等。

### 6. 长度校验

- 验证指定列中的字符串长度是否符合预设的最大长度 - 适用于需要限制字符串长度的字段，例如用户名、密码等。
"""
